In [1]:
import pandas as pd

In [2]:
# Create a Series from a list
data = [1, 3, 5, 7, 9]
s = pd.Series(data)
print(s)

0    1
1    3
2    5
3    7
4    9
dtype: int64

In [ ]:
# create a Series with custom index
s2 = pd.Series(data, index=["a", "b", "c", "d", "e"])
print(s2)

a    1
b    3
c    5
d    7
e    9
dtype: int64

In [ ]:
# Create a DataFrame
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["New York", "Los Angeles", "Chicago"],
}
df = pd.DataFrame(data)
print(df)

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [ ]:
# Load a CSV file into a DataFrame
df = pd.read_csv("customers-100.csv")
print(df.head())

   Index      Customer Id First Name Last Name  \
0      1  DD37Cf93aecA6Dc     Sheryl    Baxter
1      2  1Ef7b82A4CAAD10    Preston    Lozano
2      3  6F94879bDAfE5a6        Roy     Berry
3      4  5Cef8BFA16c5e3c      Linda     Olsen
4      5  053d585Ab6b3159     Joanna    Bender

                           Company               City  \
0                  Rasmussen Group       East Leonard
1                      Vega-Gentry  East Jimmychester
2                    Murillo-Perry      Isabelborough
3  Dominguez, Mcmillan and Donovan         Bensonview
4         Martin, Lang and Andrade     West Priscilla

                      Country                 Phone 1                Phone 2  \
0                       Chile            229.077.5154       397.884.0519x718
1                    Djibouti              5153435776       686-620-1820x944
2         Antigua and Barbuda                   -1199    (496)978-3969x58947
3          Dominican Republic  001-808-617-6467x12895                  -9892
4  Slovakia (Slovak Republic)  001-234-203-0635x76146  001-199-446-3860x3486

                         Email Subscription Date                      Website
0     zunigavanessa@smith.info        24-08-2020   http://www.stephenson.com/
1              vmata@colon.com        23-04-2021        http://www.hobbs.com/
2          beckycarr@hogan.com        25-03-2020     http://www.lawrence.com/
3  stanleyblackwell@benson.org        02-06-2020   http://www.good-lyons.com/
4      colinalvarado@miles.net        17-04-2021  https://goodwin-ingram.com/

In [14]:
# Accessing data from a DataFrame
df.loc[0][1]  # Access the first row, second column

C:\Users\harsh\AppData\Local\Temp\ipykernel_13412\3132908423.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][1]  # Access the first row, second column

'DD37Cf93aecA6Dc'

In [ ]:
df.at[0, "City"]

'New York'

In [16]:
df.iat[0, 1]  # Access the first row and second column

'DD37Cf93aecA6Dc'

In [17]:
df.iloc[0, 1]  # Access the first row and second column

'DD37Cf93aecA6Dc'

In [ ]:
import numpy as np

# Add a column to a DataFrame called 'Subscription Duration'
# set Subscription Duration to Today's date minus the Subscription Date
df["Subscription Duration"] = pd.to_datetime(
    "today", format="%Y-%m-%d"
) - pd.to_datetime(df["Subscription Date"])

C:\Users\harsh\AppData\Local\Temp\ipykernel_13412\2351370306.py:4: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Subscription Duration'] = pd.to_datetime('today', format='%Y-%m-%d') - pd.to_datetime(df['Subscription Date'])

In [28]:
df.iloc[0, -1]  # Access the first row and last column (Subscription Duration)

Timedelta('1764 days 13:15:36.879045')

In [ ]:
pd.to_datetime("today", format="%Y-%m-%d")

Timestamp('2025-06-23 13:18:28.576441')

In [ ]:
# Create a simple realistic new DataFrame for data manipulation with some null values and duplicates for practice
data = {
    "Name": ["Alice", "Bob", "Charlie", "Alice", None],
    "Age": [25, 30, 35, 25, None],
    "City": ["New York", "Los Angeles", None, "New York", "Chicago"],
}
df = pd.DataFrame(data)
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob  30.0  Los Angeles
2  Charlie  35.0         None
3    Alice  25.0     New York
4     None   NaN      Chicago

In [55]:
# check for null values
df.isnull()

    Name    Age   City
0  False  False  False
1  False  False  False
2  False  False   True
3  False  False  False
4   True   True  False

In [56]:
# Check for duplicates
df.duplicated()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [57]:
# Count the number of null values in each column
print(df.isnull().sum())
# Count the number of duplicates
print(df.duplicated().sum())

Name    1
Age     1
City    1
dtype: int64
1

In [ ]:
# Replace null values with a specific value for each column
df.fillna({"Name": "Unknown", "Age": df["Age"].mean(), "City": "Unknown"}, inplace=True)
df

      Name    Age         City
0    Alice  25.00     New York
1      Bob  30.00  Los Angeles
2  Charlie  35.00      Unknown
3    Alice  25.00     New York
4  Unknown  28.75      Chicago

In [ ]:
# Change the data type of a column
df["Age"] = df["Age"].astype(int)

In [61]:
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Unknown
3    Alice   25     New York
4  Unknown   28      Chicago

In [62]:
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Unknown
3    Alice   25     New York
4  Unknown   28      Chicago